TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_СтруктураПЛК/гкс_СтруктураПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_СтруктураПЛК</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВъездНаПЛК</name>
      <description>Въезд на ПЛК</description>
    </items>
  </predefined>
  <attributes>
    <name>НомерПроезда</name>
    <comment>Номер проезда (Кверион)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаМаршрута</name>
    <comment>для совместимости со страым механизмом назначения ям</comment>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТранспортныхСредств</name>
    <comment>Обслуживаемый тип транспортных средств</comment>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроцесса</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПроезда</name>
    <type>
      <types>CatalogRef.гкс_УсловияПроезда</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.гкс_ВидыОперацийПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОбратногоПроезда</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыТранспортныхСредствДоставки/гкс_ТипыТранспортныхСредствДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыТранспортныхСредствДоставки</name>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
  <enumValues>
    <name>ЖДТранспорт</name>
  </enumValues>
  <enumValues>
    <name>Самолёт</name>
  </enumValues>
  <enumValues>
    <name>БезДоставки</name>
  </enumValues>
  <enumValues>
    <name>Трубопровод</name>
  </enumValues>
  <enumValues>
    <name>Контейнер</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_СтруктураПЛК/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	ПроверитьУникальностьТочкиМаршрута(Объект.Ссылка, Объект.ТочкаМаршрута, Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьУникальностьТочкиМаршрута(Ссылка, ТочкаМаршрута, Отказ)
	
	Если Не ПолучитьФункциональнуюОпцию("гкс_ИспользоватьИнтеграциюСРПВ")
		Или ТочкаМаршрута.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(СтруктураПЛК.Ссылка) КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(СтруктураПЛК.ТочкаМаршрута) КАК ТочкаМаршрута
	|ИЗ
	|	Справочник.гкс_СтруктураПЛК КАК СтруктураПЛК
	|ГДЕ
	|	НЕ СтруктураПЛК.Ссылка = &Ссылка
	|	И СтруктураПЛК.ТочкаМаршрута = &ТочкаМаршрута
	|	И СтруктураПЛК.ТипТранспортныхСредств = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт)";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ТекстСообщения = СтрШаблон(
		"Точка маршрута %1 уже используется в Структуре ПЛК %2",
		Выборка.Ссылка, Выборка.ТочкаМаршрута);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	
КонецПроцедуры

#КонецОбласти
